8evgeny/GIT/Миландр. Standard Peripherals Library/Examples/MDR32F2C10/usb_cdc_echo/MDR32F2C10_usb_CDC.c
    if ( result == USB_SUCCESS )
    {
        if ( length > wLENGTH )
        {
            length = wLENGTH;
        }
        result = USB_EP_doDataIn( USB_EP0, pDescr, length, USB_DeviceDoStatusOutAck );
//        USB_EP0_SEND( (uint8_t * )pDescr, length);
    }
    return result;
}

/**
 * @brief  Class-type setup request handler for CDC.
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_CDC_ClassRequest( void )
{
    USB_Result result = USB_SUCCESS;

    uint16_t   wValue  = USB_CurrentSetupPacket.wValue,
               wIndex  = USB_CurrentSetupPacket.wIndex,
               wLength = USB_CurrentSetupPacket.wLength;

    /* Specific requests */
    switch ( USB_CurrentSetupPacket.bRequest )
    {
#ifdef USB_CDC_ENCAPSULATION_SUPPORTED
    /* SEND_ENCAPSULATED_COMMAND */
    case USB_CDC_SEND_ENCAPSULATED_COMMAND:
        result = USB_CDC_HANDLE_SEND_ENCAPSULATED_CMD( wIndex, wLength );
        break;
    /* GET_ENCAPSULATED_RESPONSE */
    case USB_CDC_GET_ENCAPSULATED_RESPONSE:
        result = USB_CDC_HANDLE_GET_ENCAPSULATED_RESP( wIndex, wLength );
        break;
#endif                                                                                                         /* USB_CDC_ENCAPSULATION_SUPPORTED */

#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
    /* SET_COMM_FEATURE */
    case USB_CDC_SET_COMM_FEATURE:
        if ( wLength == 2 )
        {
            result = USB_EP_doDataOut( USB_EP0, ( uint8_t* )&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut );
        }
        else
        {
            result = USB_ERR_INV_REQ;
        }
        break;
    /* GET_COMM_FEATURE */
    case USB_CDC_GET_COMM_FEATURE:
        if ( wLength == 2 )
        {
            result = USB_CDC_HANDLE_GET_COMM_FEATURE( wValue, wIndex, &CDC_ClassPacketData.CommFeature );
            if ( result == USB_SUCCESS )
            {
                result = USB_EP_doDataIn( USB_EP0, ( uint8_t* )&CDC_ClassPacketData, wLength,
                                          USB_DeviceDoStatusOutAck );
            }
        }
        else
        {
            result = USB_ERR_INV_REQ;
        }
        break;
    /* CLEAR_COMM_FEATURE */
    case USB_CDC_CLEAR_COMM_FEATURE:
        result = USB_CDC_HANDLE_CLEAR_COMM_FEATURE( wValue, wIndex );
        break;
#endif                                                                                                         /* USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_LINE_CODING_SUPPORTED
    /* SET_LINE_CODING */
    case USB_CDC_SET_LINE_CODING:
        if ( wLength == 7 )
        {
            result = USB_EP_doDataOut( USB_EP0, ( uint8_t* )&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut );
        }
        else
        {
            result = USB_ERR_INV_REQ;
        }
        break;
    /* GET_LINE_CODING */
    case USB_CDC_GET_LINE_CODING:
        if ( wLength == 7 )
        {
            result = USB_CDC_HANDLE_GET_LINE_CODING( wIndex, &CDC_ClassPacketData.LineCoding );
            if ( result == USB_SUCCESS )
            {
                result = USB_EP_doDataIn( USB_EP0, ( uint8_t* )&CDC_ClassPacketData, wLength,
                                          USB_DeviceDoStatusOutAck );
            }
        }
        else
        {
            result = USB_ERR_INV_REQ;
        }
        break;
#endif                                                                                                         /* USB_CDC_LINE_CODING_SUPPORTED */

#ifdef USB_CDC_CONTROL_LINE_STATE_SUPPORTED
    /* SET_CONTROL_LINE_STATE */
    case USB_CDC_SET_CONTROL_LINE_STATE:
        result = USB_CDC_HANDLE_CONTROL_LINE_STATE( wValue, wIndex );
        break;
#endif                                                                                                         /* USB_CDC_CONTROL_LINE_STATE_SUPPORTED */

#ifdef USB_CDC_LINE_BREAK_SUPPORTED
    /* SEND_BREAK */
    case USB_CDC_SEND_BREAK:
        result = USB_CDC_HANDLE_BREAK( wValue, wIndex );
        break;
#endif                                                                                                         /* USB_CDC_LINE_BREAK_SUPPORTED */

    default:
        result = USB_ERROR;
    }
    /* If there were no DATA stage, initiate Status Stage (IN ACK) */
    if ( result == USB_SUCCESS && wLength == 0 )
    {
        result = ( USB_CurrentSetupPacket.mRequestTypeData & 0x80 ) == USB_DEVICE_TO_HOST ?
                 USB_EP_doDataOut( USB_EP0, 0, 0, NULL ) :
                 USB_EP_doDataIn( USB_EP0, 0, 0, NULL );
    }

    return result;
}

/** @} */ /* End of group USB_CDC_Private_Overwritten_Device_Handlers */

/**
 * @brief  Handler called when data is sent.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with portion of data
 *                 sent
 *
 * @param  Length: Length of data portion
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */


static USB_Result USB_CDC_OnDataSent( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    /* Release "busy" flag and call user's handler */
    USB_CDCContext.CDC_SendDataStatus = USB_SUCCESS;
    return USB_CDC_HANDLE_DATA_SENT;
}


/**
 * @brief  Handler called when some data is received.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with received data
 *
 * @param  Length: Length of data
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */

static USB_Result USB_CDC_OnDataReceive( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    /* Call user's handler */
    USB_Result result = USB_CDC_HANDLE_DATA_RECEIVE( Buffer, Length );

    /* If handler returns USB_SUCCESS, wait for another portion. Otherwise, stop to receive
     * incoming data */
    if ( result != USB_SUCCESS )
    {
        USB_CDCContext.CDC_ReceiveDataStatus = USB_ERR_BUSY;
    }
    if ( USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS )
    {
        return USB_EP_doDataOut( USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                                 USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive );
    }
    else
    {
        return USB_SUCCESS;
    }
}


/**
 * @brief Implements Data stage of Setup transaction with OUT data stage
 *        for Class-Specific requests with data processing on CDC layer.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with portion of data
 *                 to be sent
 *
 * @param  Length: Length of data portion
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */

static USB_Result USB_CDC_DoDataOut( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    USB_Result result;

